# Metadata
author: Karthik Seemakurthy
date: 2023-10-20
task: detect
keywords: [transformer, swin]
description: Swin-Hugging face pretrained backbone with Detect head. Modified from https://github.com/Y-T-G/community

# Model
nc: 3
strides: [8, 16, 32]
backbone:
  # [from, repeats, module, args]
  - [-1, 1, HFaceSwin, [768, microsoft/swin-tiny-patch4-window7-224]]
  - [0, 1, Index, [192, 2]]               # (1, 80, 80, 192) - 1
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]  # (1, 192, 80, 80) - 2
  - [0, 1, Index, [384, 3]]               # (1, 40, 40, 384) - 3
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]  # (1, 384, 40, 40) - 4
  - [0, 1, Index, [768, 6]]               # (1, 20, 20, 768) - 5
  - [-1, 1, torchvision.ops.Permute, [[0, 3, 1, 2]]]  # (1, 768, 20, 20) - 6
head:
  - [[2, 4, 6], 1, Detect, [nc]]

  